worlderest/test/s1/s2/s3/s4/s5/BLE_p2pClient (1)/STM32_WPAN/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_EVENT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer, BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static uint8_t analyse_adv_report(hci_le_advertising_report_event_rp0 *p_adv_report)
{
  uint8_t adv_type = 0, adv_data_size, found_status, manufBlueST;
  uint8_t *p_adv_data;
  uint16_t i;

  found_status = 0;
  adv_type = p_adv_report->Advertising_Report[0].Event_Type;
  adv_data_size = p_adv_report->Advertising_Report[0].Length_Data;

if ((adv_type == HCI_ADV_EVT_TYPE_ADV_IND) || (adv_type == HCI_ADV_EVT_TYPE_SCAN_RSP))
  {
    uint8_t ad_length, ad_type;
    p_adv_data = (uint8_t*)(&p_adv_report->Advertising_Report[0].Length_Data) + 1;

    i = 0;
    while(i < adv_data_size)
    {
      ad_length = p_adv_data[i];
      ad_type = p_adv_data[i + 1];

      // switch (ad_type)
      // {
      //   case AD_TYPE_FLAGS:
      //     break;
      //   case AD_TYPE_TX_POWER_LEVEL:
      //     break;
      //   case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      //   {
      //     manufBlueST = UINT8_MAX;
      //     if ((ad_length >= 7) &&
      //         ((*(p_adv_data + i + 4)) == 0x02) &&  /* blueST v2*/
      //         ((*(p_adv_data + i + 6)) == 0x83))    /* p2pServer application */
      //     {
      //       /* p2pServer BlueST v2 detected */
      //       manufBlueST = 0x02;
      //     }
      //     else if ((ad_length >= 7) &&
      //              ((*(p_adv_data + i + 2)) == 0x01)) /* blueST v1*/
      //     {
      //       /* p2pServer BlueST v1 detected */
      //       manufBlueST = 0x01;
      //     }
      //     if(manufBlueST != UINT8_MAX)
      //     {
      //       bleAppContext.a_deviceServerBdAddrType = p_adv_report->Advertising_Report[0].Address_Type;
      //       bleAppContext.a_deviceServerBdAddr[0] = p_adv_report->Advertising_Report[0].Address[0];
      //       bleAppContext.a_deviceServerBdAddr[1] = p_adv_report->Advertising_Report[0].Address[1];
      //       bleAppContext.a_deviceServerBdAddr[2] = p_adv_report->Advertising_Report[0].Address[2];
      //       bleAppContext.a_deviceServerBdAddr[3] = p_adv_report->Advertising_Report[0].Address[3];
      //       bleAppContext.a_deviceServerBdAddr[4] = p_adv_report->Advertising_Report[0].Address[4];
      //       bleAppContext.a_deviceServerBdAddr[5] = p_adv_report->Advertising_Report[0].Address[5];

      //       bleAppContext.deviceServerFound = 0x01;

      //       LOG_INFO_APP("  P2P server, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
      //                       bleAppContext.a_deviceServerBdAddr[5],
      //                       bleAppContext.a_deviceServerBdAddr[4],
      //                       bleAppContext.a_deviceServerBdAddr[3],
      //                       bleAppContext.a_deviceServerBdAddr[2],
      //                       bleAppContext.a_deviceServerBdAddr[1],
      //                       bleAppContext.a_deviceServerBdAddr[0]);
      //       found_status = 1;
      //     }
      //     break;
      //   }
      //   default:
      //     break;
      //   }/* end of switch*/
// 将你 app_ble.c 中的 switch (ad_type) 部分，替换为以下内容：

      switch (ad_type)
      {
        case AD_TYPE_FLAGS:
          break;
        case AD_TYPE_TX_POWER_LEVEL:
          break;
        
        // --- 架构师修改区：改为按名字匹配 (Local Name) ---
        case AD_TYPE_COMPLETE_LOCAL_NAME:
        case AD_TYPE_SHORTENED_LOCAL_NAME:
        {
          // 比较广播包里的名字是不是咱们的 ESP_NODE_1
          // 注意：ad_length 包含了类型字本身(1字节)，所以名字实际长度是 ad_length - 1
          if ((ad_length >= 11) && 
              (strncmp((char *)(p_adv_data + i + 2), "ESP_NODE_1", 10) == 0))
          {
            // 匹配成功！记录下这个 ESP32 的 MAC 地址
            bleAppContext.a_deviceServerBdAddrType = p_adv_report->Advertising_Report[0].Address_Type;
            bleAppContext.a_deviceServerBdAddr[0] = p_adv_report->Advertising_Report[0].Address[0];
            bleAppContext.a_deviceServerBdAddr[1] = p_adv_report->Advertising_Report[0].Address[1];
            bleAppContext.a_deviceServerBdAddr[2] = p_adv_report->Advertising_Report[0].Address[2];
            bleAppContext.a_deviceServerBdAddr[3] = p_adv_report->Advertising_Report[0].Address[3];
            bleAppContext.a_deviceServerBdAddr[4] = p_adv_report->Advertising_Report[0].Address[4];
            bleAppContext.a_deviceServerBdAddr[5] = p_adv_report->Advertising_Report[0].Address[5];

            bleAppContext.deviceServerFound = 0x01; // 立起 Flag：找到了！

            LOG_INFO_APP("  Target Found: ESP_NODE_1, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                            bleAppContext.a_deviceServerBdAddr[5],
                            bleAppContext.a_deviceServerBdAddr[4],
                            bleAppContext.a_deviceServerBdAddr[3],
                            bleAppContext.a_deviceServerBdAddr[2],
                            bleAppContext.a_deviceServerBdAddr[1],
                            bleAppContext.a_deviceServerBdAddr[0]);
            
            found_status = 1; // 告诉外层函数，可以停止扫描并连接了
          }
          break;
        }
        // ---------------------------------------------
        
        default:
          break;
      }/* end of switch*/
      i += ad_length + 1; /* increment the iterator to go on next element*/
      /*
      if (found_status != 0)
      {
        break;
      }
      */
    }/* end of while*/
  }

  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;

  if (bleAppContext.deviceServerFound != 0)
  {
    LOG_INFO_APP("Create connection to P2Pserver\n");

    result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                       bleAppContext.a_deviceServerBdAddrType,
                                       &bleAppContext.a_deviceServerBdAddr[0],
                                       CFG_BD_ADDRESS_TYPE,
                                      //  CONN_INT_MS(50u), CONN_INT_MS(100u),
                                       CONN_INT_MS(15u), CONN_INT_MS(15u),
                                       0u,
                                       CONN_SUP_TIMEOUT_MS(5000u),
                                       CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      LOG_INFO_APP("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      UTIL_SEQ_WaitEvt(1u << CFG_EVENT_CONNECTION_COMPLETE);
    }
    else
    {
      LOG_INFO_APP("==>> GAP Create connection Failed , result: 0x%02x\n", result);
    }
  }

  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

